Нарисуйте блок-схему к следующей задаче: Преобразовать дату в "компьютерном" представлении (системную дату) в "российский" формат,
т.е. день/месяц/год (например, 17/05/2009).

Python 3.6.3 (v3. 6. 3:2c5fed8, Oct 3 2017, 18:11:49) [MSC V. 1900 64 бит (AMD64)] на win32
Введите "copyright", "credits" или "license ()" для получения дополнительной информации.
> > > > > > T= " 2009-06-15"
> > > > > > дата=T. split ("-")
> > > > > > печать (дата)
['2009', '06', '15']
> > > > > > печать (дата[2] + "."+дата[1]+"."+ дата[0])
15.06.2009
>>> 
