Дано вещественное число. Определить, какое это число: положительное, отрицательное, ноль.

импорт случайный
Случайность.рандинт(-100,100)
print ("A=" + str (A))
если A > 0:
 печать ("положительное число")
если A:
 печать ("отрицательное число")
если A = = 0:
 печать ("число равно нулю")
