Python 3.8.0 (теги / v3. 8. 0: fa919fd, Oct 14 2019, 19:21:23) [MSC V. 1916 32 бит (Intel)] на win32
Введите "справка", "авторское право", "кредиты" или "лицензия ()" для получения дополнительной информации.
>>> nx = input("Введите число x")
Введите число x 15
> > > > > > nx = int(nx)
>>> ny = input("Введите число y")
Введите число y 17
> > > > > > ny = int(ny)
> > > > > > если nx = = 0 или ny = = 0:
 print("Значения не должны быть равны 0,проверьте данные" )
 остальное: Z = 1/(nx*ny)
>>> print("Значение функции = ",Z)
