Имеются две ёмкости: кубическая с ребром A, цилиндрическая с высотой H и радиусом основания R. 
Определить, поместится ли жидкость объёма M в первую ёмкость, во вторую, в обе.

>>> import math
>>> A = int(input("Ребро кубической емкости"))
Ребро кубической емкости 6
>>> R = int(input("Радиус основания цилиндрической емкости"))
Радиус основания цилиндрической емкости 3
>>> H = int(input("высота цилиндрической емкости"))
высота цилиндрической емкости 7
>>> V = int(input("объем жидкости"))
объем жидкости 14
>>> Sk = math.pow(A,3)
>>> print(Sk, "объем куба")
216.0 объем куба
>>> Sc = ((math.pi) * (math.pow(R, 2)) * H)
>>> print(Sc, "объем цилиндра")
197.92033717615698 объем цилиндра
>>> if (Sk + Sc > V) :
	print("жидкость поместится в оба сосуда")

	
жидкость поместится в оба сосуда
>>> if (Sk >= V) :
	print("Жидкость поместится в куб")

	
Жидкость поместится в куб
>>> if (Sc >= V) :
	print("Жидкость поместится в цилиндр")

	
Жидкость поместится в цилиндр
>>> 
