Даны вещественные числа: A, B, C. Определить, выполняются ли неравенства A < B B > C и какое именно неравенство выполняется.

>>> import sys
>>> A = float(input("Введите вещественное число A"))
Введите вещественное число A 17
>>> B = float(input("Введите вещественное число B"))
Введите вещественное число B 19
>>> C = float(input("Введите вещественное число C"))
Введите вещественное число C 8
>>> if A < B and B > C:
	print("Оба неравенства выполняются")
	sys.exit(0)

Оба неравенства выполняются
>>> if A < B:
	print("выполняется неравенство A < B")

	
выполняется неравенство A < B
>>> if B > C:
	print("Выполняется неравенство B > C")

	
Выполняется неравенство B > C
>>> 
