Даны вещественные положительные числа a, b, c, d.
Выясните, может ли прямоугольник со сторонами a,b уместиться внутри прямоугольника со сторонами c,d так,
чтобы каждая сторона внутреннего прямоугольника была параллельна или перпендикулярна стороне внешнего прямоугольника.

import sys
a = input("введите сторону a")
b = input("введите сторону b")
c = input("введите сторону c")
d = input("введите сторону d")
if a < 0 or b < 0 or c < 0 or d < 0:
    print("сторона прямоугольника не может быть отрицательной,проверьте данные")
    sys.exit(0)

if (( a < c and b < d)
    or ( a < d and b < c)):
    print("прямоугольник ", a, b, "сможет уместиться внутри прямоугольника (",c," ",d,")")
    else:
        print("прямоугольник ", a, b, "НЕ сможет уместиться внутри прямоугольника(",c," ",d,")")
